knieriem/tinygo-stm32-svd/svd/stm32u5a5.svd
        <register>
          <name>CHSELR1</name>
          <displayName>CHSELRMOD1</displayName>
          <description>ADC channel selection register [alternate]</description>
          <alternateRegister>CHSELR0</alternateRegister>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>0x4</dimIncrement>
              <dimIndex>1-8</dimIndex>
              <name>SQ%s</name>
              <description>%s conversion of the sequence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>SQ1</name>
                <enumeratedValue>
                  <name>Channel0</name>
                  <description>CH0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Channel1</name>
                  <description>CH1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Channel2</name>
                  <description>CH2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Channel3</name>
                  <description>CH3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Channel4</name>
                  <description>CH4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Channel5</name>
                  <description>CH5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Channel6</name>
                  <description>CH6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Channel7</name>
                  <description>CH7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Channel8</name>
                  <description>CH8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Channel9</name>
                  <description>CH9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Channel10</name>
                  <description>CH10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Channel11</name>
                  <description>CH11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Channel12</name>
                  <description>CH12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Channel13</name>
                  <description>CH13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Channel14</name>
                  <description>CH14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NoChannel</name>
                  <description>No channel selected (End of sequence)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD3TR</name>
          <displayName>AWD3TR</displayName>
          <description>ADC watchdog threshold register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFF0000</resetValue>
          <fields>
            <field>
              <name>HT3</name>
              <description>HT3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>LT3</name>
              <description>LT3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <displayName>DR</displayName>
          <description>ADC data register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>DATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRR</name>
          <displayName>PWR</displayName>
          <description>ADC data register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VREFSECSMP</name>
              <description>VREFSECSMP</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>VREFSECSMP</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>VREF+ second sample disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>VREF+ second sample enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREFPROT</name>
              <description>VREFPROT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>VREFPROT</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>VREF+ protection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>VREF+ protection enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPD</name>
              <description>DPD</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DPD</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Deep-power-down mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Deep-power-down mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTOFF</name>
              <description>AUTOFF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>AUTOFF</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Auto-off mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Auto-off mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD2CR</name>
          <displayName>AWD2CR</displayName>
          <description>ADC Analog Watchdog 2 Configuration register</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>24</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-23</dimIndex>
              <name>AWD2CH%s</name>
              <description>AWD2CH%s</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>AWD2CH0</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>ADC analog input channel x is not monitored by AWDy</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>ADC analog input channel x is monitored by AWDy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD3CR</name>
          <displayName>AWD3CR</displayName>
          <description>ADC Analog Watchdog 3 Configuration register</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>24</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-23</dimIndex>
              <name>AWD3CH%s</name>
              <description>AWD3CH%s</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>AWD3CH0</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>ADC analog input channel x is not monitored by AWDy</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>ADC analog input channel x is monitored by AWDy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CALFACT</name>
          <displayName>CALFACT</displayName>
          <description>ADC Calibration factor</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CALFACT</name>
              <description>CALFACT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OR</name>
          <displayName>OR</displayName>
          <description>ADC option register</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHN21SEL</name>
              <description>CHN21SEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CHN21SEL</name>
                <enumeratedValue>
                  <name>Out1</name>
                  <description>dac1_out1 selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Out2</name>
                  <description>dac1_out2 selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <displayName>CCR</displayName>
          <description>ADC common configuration register</description>
          <addressOffset>0x308</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VBATEN</name>
              <description>VBATEN</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>VBATEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>VBAT channel disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>VBAT channel enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VSENSESEL</name>
              <description>TSEN</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>VSENSESEL</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Temperature sensor channel disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Temperature sensor channel enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREFEN</name>
              <description>VREFEN</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>VREFEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>VREFINT channel disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>VREFINT channel enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESC</name>
              <description>PRESC</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>PRESC</name>
                <enumeratedValue>
                  <name>Div1</name>
                  <description>Input ADC clock not divided</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div2</name>
                  <description>Input ADC clock divided by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div4</name>
                  <description>Input ADC clock divided by 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div6</name>
                  <description>Input ADC clock divided by 6</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div8</name>
                  <description>Input ADC clock divided by 8</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div10</name>
                  <description>Input ADC clock divided by 10</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div12</name>
                  <description>Input ADC clock divided by 12</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div16</name>
                  <description>Input ADC clock divided by 16</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div32</name>
                  <description>Input ADC clock divided by 32</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div64</name>
                  <description>Input ADC clock divided by 64</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div128</name>
                  <description>Input ADC clock divided by 128</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div256</name>
                  <description>Input ADC clock divided by 256</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
