knieriem/tinygo-stm32-svd/svd/stm32u5a5.svd
        <register>
          <name>VOSR</name>
          <displayName>VOSR</displayName>
          <description>PWR voltage scaling register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00008000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USBBOOSTRDY</name>
              <description>USB EPOD booster ready
This bit is set to 1 by hardware when the power booster startup time is reached. The USB clock can be provided only after this bit is set.
Note: This bit is only available in STM32U59x/5Ax. It is reserved in STM32U575/585.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>USBBOOSTRDY</name>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>OTG_HS power booster not ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>OTG_HS power booster ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOSTRDY</name>
              <description>EPOD booster ready
This bit is set to 1 by hardware when the power booster startup time is reached. The system clock frequency can be switched higher than 50 MHz only after this bit is set.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>BOOSTRDY</name>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>Power booster not ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Power booster ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VOSRDY</name>
              <description>Ready bit for VCORE voltage scaling output selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>VOSRDY</name>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>Not ready, voltage level &lt; VOS selected level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Ready, voltage level ≥ VOS selected level</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VOS</name>
              <description>Voltage scaling range selection
This field is protected against non-secure access when SYSCLKSEC = 1 in RCC_SECCFGR. It is protected against unprivileged access when SYSCLKSEC = 1 in RCC_SECCFGR and SPRIV = 1 in PWR_PRIVCFGR, or when SYSCLKSEC = 0 and NSPRIV = 1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>VOS</name>
                <enumeratedValue>
                  <name>Range4</name>
                  <description>Range 4 (lowest power)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Range3</name>
                  <description>Range 3</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Range2</name>
                  <description>Range 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Range1</name>
                  <description>Range 1 (highest frequency)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOSTEN</name>
              <description>EPOD booster enable
This bit is protected against non-secure access when SYSCLKSEC = 1 in RCC_SECCFGR. It is protected against unprivileged access when SYSCLKSEC = 1 in RCC_SECCFGR and SPRIV = 1 in PWR_PRIVCFGR, or when SYSCLKSEC = 0 and NSPRIV = 1.
This bit must be set in range 1 and range 2 before increasing the system clock frequency above 50 MHz.
This bit is reset when going into Stop modes (0, 1, 2, 3).</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>BOOSTEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Booster disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Booster enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBPWREN</name>
              <description>USB power enable
This bit is protected against non-secure access when SYSCLKSEC = 1 in RCC_SECCFGR. It is protected against unprivileged access when SYSCLKSEC = 1 in RCC_SECCFGR and SPRIV = 1 in PWR_PRIVCFGR, or when SYSCLKSEC = 0 and NSPRIV = 1.
Note: This bit is only available in STM32U59x/5Ax. It is reserved in STM32U575/585.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>USBPWREN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>OTG_HS power disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>OTG_HS power enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBBOOSTEN</name>
              <description>USB EPOD booster enable
This bit is protected against non-secure access when SYSCLKSEC = 1 in RCC_SECCFGR. It is protected against unprivileged access when SYSCLKSEC = 1 in RCC_SECCFGR and SPRIV = 1 in PWR_PRIVCFGR, or when SYSCLKSEC = 0 and NSPRIV = 1.
This bit must be set in range 1 and range 2 before enabling the USB peripheral.
This bit is reset when going into Stop modes (0, 1, 2, 3).
Note: This bit is only available in STM32U59x/5Ax. It is reserved in STM32U575/585.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>USBBOOSTEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>OTG_HS booster disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>OTG_HS booster enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDD11USBDIS</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>VDD11USBDIS</name>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>VDD11USB enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>VDD11USB disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SVMCR</name>
          <displayName>SVMCR</displayName>
          <description>PWR supply voltage monitoring control register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PVDE</name>
              <description>Power voltage detector enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>PVDE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>PVD disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>PVD enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PVDLS</name>
              <description>Power voltage detector level selection
These bits select the voltage threshold detected by the power voltage detector:</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>PVDLS</name>
                <enumeratedValue>
                  <name>VPVD0</name>
                  <description>VPVD0 around 2.0 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VPVD1</name>
                  <description>VPVD1 around 2.2 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VPVD2</name>
                  <description>VPVD2 around 2.4 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VPVD3</name>
                  <description>VPVD3 around 2.5 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VPVD4</name>
                  <description>VPVD4 around 2.6 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VPVD5</name>
                  <description>VPVD5 around 2.8 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VPVD6</name>
                  <description>VPVD6 around 2.9 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDIN</name>
                  <description>External input analog voltage PVD_IN (compared internally to VREFINT)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UVMEN</name>
              <description>VDDUSB independent USB voltage monitor enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>UVMEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>VDDUSB voltage monitor disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>VDDUSB voltage monitor enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IO2VMEN</name>
              <description>VDDIO2 independent I/Os voltage monitor enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>IO2VMEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>VDDIO2 voltage monitor disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>VDDIO2 voltage monitor enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVM1EN</name>
              <description>VDDA independent analog supply voltage monitor 1 enable (1.6 V threshold)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>AVM1EN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>VDDA voltage monitor 1 disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>VDDA voltage monitor 1 enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVM2EN</name>
              <description>VDDA independent analog supply voltage monitor 2 enable (1.8 V threshold)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>AVM2EN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>VDDA voltage monitor 2 disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>VDDA voltage monitor 2 enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USV</name>
              <description>VDDUSB independent USB supply valid
This bit is used to validate the VDDUSB supply for electrical and logical isolation purpose.
Setting this bit is mandatory to use the USB OTG peripheral. If VDDUSB is not always present in the application, the VDDUSB voltage monitor can be used to determine whether this supply is ready or not.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>USV</name>
                <enumeratedValue>
                  <name>NotPresent</name>
                  <description>VDDUSB not present: logical and electrical isolation is applied to ignore this supply</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>VDDUSB valid</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IO2SV</name>
              <description>VDDIO2 independent I/Os supply valid
This bit is used to validate the VDDIO2 supply for electrical and logical isolation purpose.
Setting this bit is mandatory to use PG[15:2]. If VDDIO2 is not always present in the application, the VDDIO2 voltage monitor can be used to determine whether this supply is ready or not.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>IO2SV</name>
                <enumeratedValue>
                  <name>NotPresent</name>
                  <description>VDDIO2 not present: logical and electrical isolation is applied to ignore this supply</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>VDDIO2 valid</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASV</name>
              <description>VDDA independent analog supply valid
This bit is used to validate the VDDA supply for electrical and logical isolation purpose.
Setting this bit is mandatory to use the analog peripherals. If VDDA is not always present in the application, the VDDA voltage monitor can be used to determine whether this supply is ready or not.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>ASV</name>
                <enumeratedValue>
                  <name>NotPresent</name>
                  <description>VDDA not present: logical and electrical isolation is applied to ignore this supply</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>VDDA valid</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WUCR1</name>
          <displayName>WUCR1</displayName>
          <description>PWR wakeup control register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WUPEN1</name>
              <description>Wakeup pin WKUP1 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>WUPEN1</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Wakeup pin disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Wakeup pin enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPEN2</name>
              <description>Wakeup pin WKUP2 enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPEN1"/>
            </field>
            <field>
              <name>WUPEN3</name>
              <description>Wakeup pin WKUP3 enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPEN1"/>
            </field>
            <field>
              <name>WUPEN4</name>
              <description>Wakeup pin WKUP4 enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPEN1"/>
            </field>
            <field>
              <name>WUPEN5</name>
              <description>Wakeup pin WKUP5 enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPEN1"/>
            </field>
            <field>
              <name>WUPEN6</name>
              <description>Wakeup pin WKUP6 enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPEN1"/>
            </field>
            <field>
              <name>WUPEN7</name>
              <description>Wakeup pin WKUP7 enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPEN1"/>
            </field>
            <field>
              <name>WUPEN8</name>
              <description>Wakeup pin WKUP8 enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPEN1"/>
            </field>
          </fields>
        </register>
